app/controllers/breweries_controller.rb

SELECT * FROM `breweries` WHERE (`breweries`.`id` = 1)
---
  def show
    @brewery = Brewery.find( params[:id] )