app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `last_request_at`, `crypted_password`, `updated_at`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`) VALUES('2010-01-17 02:11:29', '2010-01-17 02:11:29', '6fc984acb1722d44d8a726ffd350c7778c0e4998606ab1198efb58e8f3556f2fe4f3f166d3d32c0ac07b7189ff60f3387732277ae8b454ae4ca40d0470c6eacf', '2010-01-17 02:11:29', '127.0.0.1', 'Eb6vtlYNHCoLrslXf6uo', '2010-01-17 02:11:29', '4568f7edfbd86ffe42ac44616f2da78f209fb8bfc244c62057f9dc007a4c5b53819330064978c2f28d5a280e51174b9f68ed837e81833a04476fb2709f679617', 1, NULL, 'adam', NULL)